Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/accelerometer.po
Languages: sk

source: Accelerometer
sk: Akcelerometer

source: This object gives you access to the on-board accelerometer. The accelerometer also provides convenience functions for detecting gestures. The recognised gestures are: ``up``, ``down``, ``left``, ``right``, ``face up``, ``face down``, ``freefall``, ``3g``, ``6g``, ``8g``, ``shake``.
sk: Tento objekt umožňuje prístup k akcelerometru na doske. Akcelerometer tiež poskytuje funkcie na detekciu gest a dokáže rozoznať tieto gestá: ``hore``, ``dole``, ``vľavo``, ``vpravo``, ``tvárou nahor``, ``tvárou nadol``, ``voľný pád``, ``3g``, ``6g``, ``8g``, ``trasenie``.

source: Functions
sk: Funkcie

source: Get the acceleration measurement in the ``x`` axis, as a positive or negative integer, depending on the direction.
sk: Získaj meranie zrýchlenia v smere osi ``x`` ako kladné alebo záporné číslo v závislosti od smeru.

source: Get the acceleration measurement in the ``y`` axis, as a positive or negative integer, depending on the direction.
sk: Získaj meranie zrýchlenia v smere osi ``y`` ako kladné alebo záporné číslo v závislosti od smeru.

source: Get the acceleration measurement in the ``z`` axis, as a positive or negative integer, depending on the direction.
sk: Získaj meranie zrýchlenia v smere osi ``z`` ako kladné alebo záporné číslo v závislosti od smeru.

source: Get the acceleration measurements in all axes at once, as a three-element tuple of integers ordered as X, Y, Z.
sk: Získaj merania zrýchlenia vo všetkých osiach naraz ako trojicu čísel zoradených ako X, Y, Z.

source: Return the name of the current gesture.
sk: Vráti názov aktuálneho gesta.

source: MicroPython understands the following gesture names: ``"up"``, ``"down"``, ``"left"``, ``"right"``, ``"face up"``, ``"face down"``, ``"freefall"``, ``"3g"``, ``"6g"``, ``"8g"``, ``"shake"``. Gestures are always represented as strings.
sk: MicroPython pozná tieto názvy gest: ``"up"`` (hore), ``"down"`` (dole), ``"left"`` (vľavo), ``"right"`` (vpravo), ``"face up"`` (tvárou nahor), ``"face down"`` (tvárou nadol), ``"freefall"`` (voľný pád), ``"3g"``, ``"6g"``, ``"8g"``, ``"shake"`` (trasenie). Gestá sú vždy reprezentované ako reťazce.

source: Return True or False to indicate if the named gesture is currently active.
sk: Vráti True alebo False, čím naznačí či je známe gesto aktuálne aktívne.

source: Return True or False to indicate if the named gesture was active since the last call.
sk: Vráti True alebo False, čím naznačí či známe gesto bolo aktívne od posledného volania.

source: Examples
sk: Príklady

source: A fortune telling magic 8-ball. Ask a question then shake the device for an answer.
sk: Kúzelná veštecká guľa. Spýtaj sa otázku, potras zariadením a získaj odpoveď.

source: Simple Slalom. Move the device to avoid the obstacles.
sk: Jednoduchý slalom. Pohybuj zariadením a vyhýbaj sa prekážkam.
