Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/audio.po
Languages: sk

source: This module allows you play sounds from a speaker attached to the Microbit. In order to use the audio module you will need to provide a sound source.
sk: Tento modul ti umožňuje zahrať zvuky z reproduktorov pripojených k microbitu. Aby si mohol/mohla používať modul audio, musíš zabezpečiť zdroj zvuku.

source: A sound source is an iterable (sequence, like list or tuple, or a generator) of frames, each of 32 samples. The ``audio`` modules plays samples at the rate of 7812.5 samples per second, which means that it can reproduce frequencies up to 3.9kHz.
sk: Zdroj zvuku je iterovateľná premenná (teda sekvencia, podobne ako zoznam, n-tica či generátor) rámcov, z ktorých každý pozostáva z 32 zvukov. ``audio`` moduly hrajú zvuky rýchlosťou 7812.5 zvukov za sekundu, čo znamená, že dokáže reprodukovať frekvencie do výšky 3.9 kHz.

source: Functions
sk: Funkcie

source: Play the source to completion.
sk: Prehraj zdroj do konca.

source: ``source`` is an iterable, each element of which must be an ``AudioFrame``.
sk: ``source`` je iterovateľná premenná, ktorej každý prvok musí byť ``AudioFrame``.

source: If ``wait`` is ``True``, this function will block until the source is exhausted.
sk: Ak ``wait`` (čakať) je ``True``, táto funkcia bude blokovať do vyčerpania zdroja.

source: ``pins`` specifies which pins the speaker is connected to.
sk: ``pins`` definuje, ku ktorým pinom je reproduktor pripojený.

source: Classes
sk: Triedy

source: An ``AudioFrame`` object is a list of 32 samples each of which is a signed byte (whole number between -128 and 127).
sk: Objekt ``AudioFrame`` je zoznam 32 samplov, z ktorých každý je signovaný byte (celé číslo medzi -128 a 127).

source: It takes just over 4 ms to play a single frame.
sk: Prehrať jeden rámec trvá 4 ms.

source: Using audio
sk: Použitie audia

source: Technical Details
sk: Technické detaily

source: Example
sk: Príklad
