Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/button.po
Languages: sk

source: Buttons
sk: Tlačítka

source: There are two buttons on the board, called ``button_a`` and ``button_b``.
sk: Na doske sú dve tlačítka, volajú sa ``button_a`` (tlačítko_a) a ``button_b`` (tlačítko_b).

source: Attributes
sk: Vlastnosti

source: A ``Button`` instance (see below) representing the left button.
sk: Inštancia ``Button`` (pozri nižšie) predstavuje ľavé tlačítko.

source: Represents the right button.
sk: Predstavuje pravé tlačítko.

source: Classes
sk: Triedy

source: Represents a button.
sk: Predstavuje tlačítko.

source: This class is not actually available to the user, it is only used by the two button instances, which are provided already initialized.
sk: Táto trieda ani nie je k dispozícii užívateľom, využívajú ju iba dve inštancie tlačítok, ktoré sú k dispozícii už inicializované.

source: Returns ``True`` if the specified button ``button`` is pressed, and ``False`` otherwise.
sk: Vráti ``True`` ak zadané tlačítko ``button`` je stlačené a ``False`` ak nie je.

source: Returns ``True`` or ``False`` to indicate if the button was pressed since the device started or the last time this method was called.
sk: Vráti ``True`` alebo ``False`` podľa toho, či tlačítko bol stlačené od spustenia zariadenia alebo od posledného volania tejto metódy.

source: Returns the running total of button presses, and resets this total to zero before returning.
sk: Vráti celkový počet stlačení tlačítka a následne ho vynuluje.

source: Example
sk: Príklad
