Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/microbit_micropython_api.po
Languages: sk

source: As we work towards a 1.0 release, this API is subject to frequent changes. This page reflects the current micro:bit API in a developer-friendly (but not necessarily kid-friendly) way. The tutorials associated with this documentation are a good place to start for non-developers looking for information.
sk: Keďže pracujeme na verzii 1.0, tento API podlieha častým zmenám. Táto stránka odráža aktuálne micro:bit API spôsobom vhodným pre vývojárov (ale nie nevyhnutne pre deti). Tutoriály spojené s touto dokumentáciou sú vhodným úvodom pre nevývojárov, ktorí hľadajú informácie.

source: The microbit module
sk: Microbit modul

source: Everything directly related to interacting with the hardware lives in the `microbit` module. For ease of use it's recommended you start all scripts with::
sk: Všetko, čo priamo súvisí s interakciou s hardvérom, sa nachádza v module mikrobit. Pre jednoduchosť používania sa odporúča začať všetky skripty pomocou::

source: The following documentation assumes you have done this.
sk: Nasledujúca dokumentácia predpokladá, že si to urobil.

source: There are a few functions available directly::
sk: Niekoľko funkcií je dostupných priamo::

source: The rest of the functionality is provided by objects and classes in the microbit module, as described below.
sk: Zvyšok funkčnosti poskytujú objekty a classes v module mikrobit, ako je opísané nižšie.

source: Note that the API exposes integers only (ie no floats are needed, but they may be accepted). We thus use milliseconds for the standard time unit.
sk: Ber na vdomie, že rozhranie API exposes iba celé čísla (t. j. nie sú potrebné floats, ale môžu byť akceptované). Pre štandardnú časovú jednotku teda používame milisekundy.

source: Buttons
sk: Tlačítka

source: There are 2 buttons::
sk: Sú 2 tlačítka::

source: These are both objects and have the following methods::
sk: Obe sú objekty a majú nasledujúce metódy::

source: The LED display
sk: LED displej

source: The LED display is exposed via the `display` object::
sk: LED displej je exposed pomocou objektu display::

source: Pins
sk: Piny

source: Provide digital and analog input and output functionality, for the pins in the connector. Some pins are connected internally to the I/O that drives the LED matrix and the buttons.
sk: Zabezpečujú digitálne a analógové vstupné a výstupné funkcie pinov v konektore. Niektoré piny sú vnútorne prepojené s I/O, ktorý poháňa LED maticu a tlačítka.

source: Each pin is provided as an object directly in the ``microbit`` module. This keeps the API relatively flat, making it very easy to use:
sk: Každý pin je k dispozícii ako objekt priamo v module mikrobit. Toto udržuje rozhranie API relatívne flat, takže sa používa veľmi jednoducho:

source: *Warning: P17-P18 (inclusive) are unavailable.*
sk: Upozornenie: P17-P18 (vrátane) sú nedostupné

source: Each of these pins are instances of the ``MicroBitPin`` class, which offers the following API::
sk: Každý z týchto pinov je príkladom class MicroBitPin, ktorá ponúka nasledujúce API::

source: Images
sk: Obrázky

source: You don't always need to create one of these yourself - you can access the image shown on the display directly with `display.image`. `display.image` is just an instance of `Image`, so you can use all of the same methods.
sk: Nemusíš vždy vytvoriť jeden z nich sám - môžeš sa dostať k obrázku zobrazenom na displeji priamo pomocou display.image. display.image je len príkladom Image, takže môžeš použiť všetky rovnaké metódy.

source: Images API::
sk: Rozhranie API pre obrázky::

source: The accelerometer
sk: Akcelerometer

source: The accelerometer is accessed via the ``accelerometer`` object::
sk: K akcelerometru sa pristupuje cez objekt akcelerometer::

source: The recognised gestures are: ``up``, ``down``, ``left``, ``right``, ``face up``, ``face down``, ``freefall``, ``3g``, ``6g``, ``8g``, ``shake``.
sk: Akcelerometer rozpoznáva tieto gestá: up, down, left, right, face up, face down, freefall, 3g, 6g, 8g, shake.

source: The compass
sk: Kompas

source: The compass is accessed via the `compass` object::
sk: Ku kompasu sa pristupuje cez objekt compass::

source: I2C bus
sk: Zbernica I2C

source: There is an I2C bus on the micro:bit that is exposed via the `i2c` object. It has the following methods::
sk: Micro:bit má zbernicu I2C, ktorá je exposed pomocou objektu I2C. Má nasledujúce metódy::

source: Use ``uart`` to communicate with a serial device connected to the device's I/O pins::
sk: Použite uart na komunikáciu so sériovým zariadením pripojeným k I/O pinom zariadenia::
