Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/hello.po
Languages: sk_sk

source: Hello, World!
sk_sk: Ahoj, svet!

source: The traditional way to start programming in a new language is to get your computer to say, "Hello, World!".
sk_sk: Tradičným spôsobom, ako začať programovať v novom programovacom jazyku je naučiť tvoj počítač povedať "Ahoj, svet!".

source: This is easy with MicroPython::
sk_sk: S MicroPythonom je to ľahké::

source: Each line does something special. The first line::
sk_sk: Každý riadok robí niečo špeciálne. Prvý riadok::

source: ...tells MicroPython to get all the stuff it needs to work with the BBC micro:bit. All this stuff is in a module called ``microbit`` (a module is a library of pre-existing code). When you ``import`` something you're telling MicroPython that you want to use it, and ``*`` is Python's way to say *everything*. So, ``from microbit import *`` means, in English, "I want to be able to use everything from the microbit code library".
sk_sk: ...povie MicroPythonu, aby zohnal všetky veci, ktoré bude potrebovať na prácu s BBC micro:bitom. A všetky veci sú v module, ktorý sa volá ``microbit`` (modul je knižnica s prepripraveným kódom). Keď niečo ``import``uješ, hovoríš MicroPythonu, že to chceš používať a ``*`` je v Pythone spôsob, ako povedať *všetko*. Takže ``from microbit import *`` znamená po slovensky "Chcem mať možnosť používať všetko z knižnice microbit".

source: The second line::
sk_sk: Druhý riadok::

source: ...tells MicroPython to use the display to scroll the string of characters "Hello, World!". The ``display`` part of that line is an *object* from the ``microbit`` module that represents the device's physical display (we say "object" instead of "thingy", "whatsit" or "doodah"). We can tell the display to do things with a full-stop ``.`` followed by what looks like a command (in fact it's something we call a *method*). In this case we're using the ``scroll`` method. Since ``scroll`` needs to know what characters to scroll across the physical display we specify them between double quotes (``"``) within parenthesis (``(`` and ``)``). These are called the *arguments*. So, ``display.scroll("Hello, World!")`` means, in English, "I want you to use the display to scroll the text 'Hello, World!'". If a method doesn't need any arguments we make this clear by using empty parenthesis like this: ``()``.
sk_sk: ...povie MicroPythonu, že má použiť displej a posúvať na ňom reťazec znakov "Ahoj, svet!". Časť ``display`` na tomto riadku je *objekt* z modulu ``microbit``, ktorý predstavuje fyzický displej zariadenia (hovoríme "objekt" namiesto "hento", "oné" alebo "tá vec"). Displeju môžeme prikázať robiť rôzne veci pomocou bodky ``.`` nasledovanej niečím, čo vyzerá ako príkaz (v skutočnosti sa to volá *metóda*). V tomto prípade oužívame metódu ``scroll``, čo po slovensky znamená posúvať. Keďže funkcia ``scroll`` potrebuje vedieť, aké znaky má posúvať na displeji, musíme špecifikovať, ktoré to majú byť pomocou dvojitých úvodzoviek (``"``) v zátvorke (``(`` a ``)``). To nazývame *argument*. Takže ``display.scroll("Ahoj, svet!")`` znamená po slovensky "Chcem, aby si použil displej a posúval na ňom text 'Ahoj, svet!'". Ak metóda nepotrebuje argumenty, musíme to dať jasne najavo použitím prádznych zátvoriek - takto: ``()``.

source: Copy the "Hello, World!" code into your editor and flash it onto the device. Can you work out how to change the message? Can you make it say hello to you? For example, I might make it say "Hello, Nicholas!". Here's a clue, you need to change the scroll method's argument.
sk_sk: Skopíruj kód "Ahoj, svet!" do svojho editora a nahraj ho na micro:bit. Prídeš na to, ako zmeniť text? Podarí sa ti zariadiť, aby pozdravil teba? Napríklad, ja by som chcel, aby ma pozdravil "Ahoj, Nicholas!". Drobná rada: musíš zmeniť argument metódy na posúvanie textu.

source: It may not work. :-)
sk_sk: Možno to nebude fungovať. :-)

source: This is where things get fun and MicroPython tries to be helpful. If it encounters an error it will scroll a helpful message on the micro:bit's display. If it can, it will tell you the line number for where the error can be found.
sk_sk: Teraz to začína byť zábava a MicroPython sa snaží pomôcť. Ak natrafí na chybu, bude posúvať informáciu o nej na displeji micro:bitu. Ak to je možné, povie ti číslo riadku, kde nastala chyba.

source: Python expects you to type **EXACTLY** the right thing. So, for instance, ``Microbit``, ``microbit`` and ``microBit`` are all different things to Python. If MicroPython complains about a ``NameError`` it's probably because you've typed something inaccurately. It's like the difference between referring to "Nicholas" and "Nicolas". They're two different people but their names look very similar.
sk_sk: Python očakáva, že napíšeš **PRESNE** správny kód. Takže napríklad ``Microbit``, ``microbit`` a ``microBit`` sú v Pythone rôzne veci. Ak sa MicroPython sťažuje na ``NameError`` (po slovensky "chyba názvu"), je to zrejme preto, že niečo je napísané nepresne. Je to podobné ako hovoriť o "Nicholasovi" a "Nicolasovi". Sú to rôzni ľudia, hoci ich mená sú veľmi podobné.

source: If MicroPython complains about a ``SyntaxError`` you've simply typed code in a way that MicroPython can't understand. Check you're not missing any special characters like ``"`` or ``:``. It's like putting. a full stop in the middle of a sentence. It's hard to understand exactly what you mean.
sk_sk: Ak sa MicroPython sťažuje na ``SyntaxError`` (slovensky "chyba syntaxe"), znamená to, že si jednoducho napísal(a) kód, ktorému MicroPython nerozumie. Skontroluj, či ti nechýbajú nejaké špeciálne znaky ako napríklad ``"`` alebo ``:``. Je to ako keď. dáš bodku do stredu vety. Je potom ťažké pochopiť, čo chceš vlastne povedať.

source: Your microbit may stop responding: you cannot flash new code to it or enter commands into the REPL. If this happens, try power cycling it. That is, unplug the USB cable (and battery cable if it's connected), then plug the cable back in again. You may also need to quit and re-start your code editor application.
sk_sk: Tvoj microbit možno prestane odpovedať: nemôžeš nahrať nový kód ani zadať príkazy cez REPL. Ak sa to stane, skús odpojiť USB kábel (a aj kábel z batérie, ak je pripojený) a znova ho zapoj. Možno budeš potrebovať aj reštartovať svoj editor.
