Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/images.po
Languages: sk

source: Images
sk: Obrázky

source: MicroPython is about as good at art as you can be if the only thing you have is a 5x5 grid of red LEDs (light emitting diodes - the things that light up on the front of the device). MicroPython gives you quite a lot of control over the display so you can create all sorts of interesting effects.
sk: Čo sa týka umenia, MicroPython ja asi rovnako dobrý ako ty, pokiaľ by si mal(a) k dispozícii iba sieť 5x5 červených LED diód (to sú tie svetielka na prednej strane zariadenia). MicroPython ti dáva pomerne veľa možností, ako ovládať displej, takže môžeš vytvoriť všelijaké zaujímavé efekty.

source: MicroPython comes with lots of built-in pictures to show on the display. For example, to make the device appear happy you type::
sk: MicroPython má množstvo zabudovaných obrázkov, ktoré vie zobraziť na displeji. Napríklad, ak chceš, aby micro:bit vyzeral šťastne, napíš::

source: I suspect you can remember what the first line does. The second line uses the ``display`` object to ``show`` a built-in image. The happy image we want to display is a part of the ``Image`` object and called ``HAPPY``. We tell ``show`` to use it by putting it between the parenthesis (``(`` and ``)``).
sk: Predpokladám, že si pamätáš, čo robí prvý riadok. Druhý riadok hovorí objektu ``display`` (="displej"), že má ``show`` (="zobraziť") vstavaný obrázok. Šťastný obrázok, ktorý chceme zobraziť je súčasťou objektu ``Image`` ("obrázok") a volá sa ``HAPPY`` (="ŠŤASTNÝ"). Metóde ``show`` ((="zobraziť") povieme, že má použiť práve ten tak, že zadáme jeho názov do zátvoriek (``(`` a ``)``).

source: Here's a list of the built-in images:
sk: Tu je zoznam vstavaných obrázkov:

source: ``Image.HEART``
sk: ``Image.HEART`` (obrázok SRDCE)

source: ``Image.HEART_SMALL``
sk: ``Image.HEART_SMALL`` (obrázok MALÉ SRDCE)

source: ``Image.HAPPY``
sk: ``Image.HAPPY`` (obrázok ŠŤASTNÝ)

source: ``Image.SMILE``
sk: ``Image.SMILE`` (obrázok ÚSMEV)

source: ``Image.SAD``
sk: ``Image.SAD`` (obrázok SMUTNÝ)

source: ``Image.CONFUSED``
sk: ``Image.CONFUSED`` (obrázok ZMÄTENÝ)

source: ``Image.ANGRY``
sk: ``Image.ANGRY`` (obrázok NAHNEVANÝ)

source: ``Image.ASLEEP``
sk: ``Image.ASLEEP`` (obrázok SPIACI)

source: ``Image.SURPRISED``
sk: ``Image.SURPRISED`` (obrázok PREKVAPENÝ)

source: ``Image.SILLY``
sk: ``Image.SILLY`` (obrázok HLÚPY)

source: ``Image.FABULOUS``
sk: ``Image.FABULOUS`` (obrázok ÚŽASNÝ)

source: ``Image.MEH``
sk: ``Image.MEH`` (obrázok MEH)

source: ``Image.YES``
sk: ``Image.YES`` (obrázok ÁNO)

source: ``Image.NO``
sk: ``Image.NO`` (obrázok NIE)

source: ``Image.CLOCK12``, ``Image.CLOCK11``, ``Image.CLOCK10``, ``Image.CLOCK9``, ``Image.CLOCK8``, ``Image.CLOCK7``, ``Image.CLOCK6``, ``Image.CLOCK5``, ``Image.CLOCK4``, ``Image.CLOCK3``, ``Image.CLOCK2``, ``Image.CLOCK1``
sk: ``Image.CLOCK12``, ``Image.CLOCK11``, ``Image.CLOCK10``, ``Image.CLOCK9``, ``Image.CLOCK8``, ``Image.CLOCK7``, ``Image.CLOCK6``, ``Image.CLOCK5``, ``Image.CLOCK4``, ``Image.CLOCK3``, ``Image.CLOCK2``, ``Image.CLOCK1`` (obrázky HODÍN o 12.-1. hodine)

source: ``Image.ARROW_N``, ``Image.ARROW_NE``, ``Image.ARROW_E``, ``Image.ARROW_SE``, ``Image.ARROW_S``, ``Image.ARROW_SW``, ``Image.ARROW_W``, ``Image.ARROW_NW``
sk: ``Image.ARROW_N``, ``Image.ARROW_NE``, ``Image.ARROW_E``, ``Image.ARROW_SE``, ``Image.ARROW_S``, ``Image.ARROW_SW``, ``Image.ARROW_W``, ``Image.ARROW_NW`` (obrázky ŠÍPOK v rôznych smeroch označených anglickými skratkami zemepisných smerov (N-sever, S-juh, E-východ, W - západ)

source: ``Image.TRIANGLE``
sk: ``Image.TRIANGLE`` (obrázok TROJUHOLNÍK)

source: ``Image.TRIANGLE_LEFT``
sk: ``Image.TRIANGLE_LEFT`` (obrázok TROJUHOLNÍK VĽAVO)

source: ``Image.CHESSBOARD``
sk: ``Image.CHESSBOARD`` (obrázok ŠACHOVNICA)

source: ``Image.DIAMOND``
sk: ``Image.DIAMOND`` (obrázok DIAMANT)

source: ``Image.DIAMOND_SMALL``
sk: ``Image.DIAMOND_SMALL`` (obrázok MALÝ DIAMANT)

source: ``Image.SQUARE``
sk: ``Image.SQUARE`` (obrázok ŠTVOREC)

source: ``Image.SQUARE_SMALL``
sk: ``Image.SQUARE_SMALL`` (obrázok MALÝ ŠTVOREC)

source: ``Image.RABBIT``
sk: ``Image.RABBIT`` (obrázok ZAJAC)

source: ``Image.COW``
sk: ``Image.COW`` (obrázok KRAVA)

source: ``Image.MUSIC_CROTCHET``
sk: ``Image.MUSIC_CROTCHET`` (obrázok ŠTVRŤOVǍ NOTA)

source: ``Image.MUSIC_QUAVER``
sk: ``Image.MUSIC_QUAVER`` (obrázok OSMINOVÁ NOTA)

source: ``Image.MUSIC_QUAVERS``
sk: ``Image.MUSIC_QUAVER`` (obrázok OSMINOVÉ NOTY)

source: ``Image.PITCHFORK``
sk: ``Image.PITCHFORK`` (obrázok VIDLIČKA)

source: ``Image.XMAS``
sk: ``Image.XMAS`` (obrázok VIANOCE)

source: ``Image.PACMAN``
sk: ``Image.PACMAN`` (obrázok PACMAN)

source: ``Image.TARGET``
sk: ``Image.TARGET`` (obrázok TERČ)

source: ``Image.TSHIRT``
sk: ``Image.TSHIRT`` (obrázok TRIČKO)

source: ``Image.ROLLERSKATE``
sk: ``Image.ROLLERSKATE`` (obrázok KOLIESKOVÉ KORČULE)

source: ``Image.DUCK``
sk: ``Image.DUCK`` (obrázok KAČICA)

source: ``Image.HOUSE``
sk: ``Image.HOUSE`` (obrázok DOM)

source: ``Image.TORTOISE``
sk: ``Image.TORTOISE`` (obrázok KORYTNAČKA)

source: ``Image.BUTTERFLY``
sk: ``Image.BUTTERFLY`` (obrázok MOTÝĽ)

source: ``Image.STICKFIGURE``
sk: ``Image.STICKFIGURE`` (obrázok POSTAVIČKA)

source: ``Image.GHOST``
sk: ``Image.GHOST`` (obrázok DUCH)

source: ``Image.SWORD``
sk: ``Image.SWORD`` (obrázok MEČ)

source: ``Image.GIRAFFE``
sk: ``Image.GIRAFFE`` (obrázok ŽIRAFA)

source: ``Image.SKULL``
sk: ``Image.SKULL`` (obrázok LEBKA)

source: ``Image.UMBRELLA``
sk: ``Image.UMBRELLA`` (obrázok DÁŽDNIK)

source: ``Image.SNAKE``
sk: ``Image.SNAKE`` (obrázok HAD)

source: There's quite a lot! Why not modify the code that makes the micro:bit look happy to see what some of the other built-in images look like? (Just replace ``Image.HAPPY`` with one of the built-in images listed above.)
sk: Je ich fakt dosť! Skúsme, ako bude vyzerať micro:bit, keď vymeníme jeho šťastný obrázok za nejaký iný vstavaný obrázok. (Jednoducho iba nahraď obrázok ``Image.HAPPY`` za nejaký iný zo zoznamu.)

source: DIY Images
sk: Vlastné obrázky

source: Of course, you want to make your own image to display on the micro:bit, right?
sk: Jasné, chceš si urobiť vlastný obrázok, ktorý sa zobrazí na micro:bite, však?

source: That's easy.
sk: Je to jednoduché.

source: Each LED pixel on the physical display can be set to one of ten values. If a pixel is set to ``0`` (zero) then it's off. It literally has zero brightness. However, if it is set to ``9`` then it is at its brightest level. The values ``1`` to ``8`` represent the brightness levels between off (``0``) and full on (``9``).
sk: Na každom LED pixeli displeja vieme nastaviť jednu z deisatich hodnôt. Ak má pixel hodnotu ``0`` (nula), je vypnutý. Má doslova nulový jas. Ale ak ho nastavíme na ``9``, potom má najvyšší jas. Hodnoty ``1`` až ``8`` predstavujú úrovne jasu medzi vypnutou diódou (``0``) a maximálnym jasom (``9``).

source: Armed with this information, it's possible to create a new image like this::
sk: Vyzbrojení touto informáciou môžeme vytvoriť nový obrázok takto jednoducho::

source: (When run, the device should display an old-fashioned "Blue Peter" sailing ship with the masts dimmer than the boat's hull.)
sk: (Keď sa to spustí, zariadenie by malo zobraziť historickú loď "Modrý Peter" so stožiarmi, ktoré sú tmavšie ako trup lode.)

source: Have you figured out how to draw a picture? Have you noticed that each line of the physical display is represented by a line of numbers ending in ``:`` and enclosed between ``"`` double quotes? Each number specifies a brightness. There are five lines of five numbers so it's possible to specify the individual brightness for each of the five pixels on each of the five lines on the physical display. That's how to create a new image.
sk: Už vieš ako nakresliť obrázok? Vidíš, že každý riadok displeja sa zobrazuje ako riadok čísel končiaci ``:`` a uzavretý dvojitými úvodzovkami ``"``? Každé z čísiel označuje jas. Keďže je tam päť riadkov po päť čísiel, dokážeme tak nastaviť jas pre každý jeden pixel displeja. Takto vytvárame nové obrázky.

source: Simple!
sk: Jendoduché!

source: In fact, you don't need to write this over several lines. If you think you can keep track of each line, you can rewrite it like this::
sk: Vlastne, ani ich nepotrebuješ písať na niekoľko riadkov. Ak si myslíš, že nestratíš prehľad, môžeš ich zapísať aj takto::

source: Animation
sk: Animácia

source: Static images are fun, but it's even more fun to make them move. This is also amazingly simple to do with MicroPython ~ just use a list of images!
sk: Statické (nemenné) obrázky sú zábavné, ale oveľa väčšia zábava je, keď ich rozhýbeš. S MicroPythonom je aj toto úžasne ľahké - jednoducho použi zoznam obrázkov!

source: Here is a shopping list::
sk: Tu je náš nákupný zoznam::

source: Here's how you'd represent this list in Python::
sk: Takto zapíšeš zoznam v Pythone::

source: I've simply created a list called ``shopping`` and it contains three items. Python knows it's a list because it's enclosed in square brackets (``[`` and ``]``). Items in the list are separated by a comma (``,``) and in this instance the items are three strings of characters: ``"Eggs"``, ``"Bacon"`` and ``"Tomatoes"``. We know they are strings of characters because they're enclosed in quotation marks ``"``.
sk: Vytvoril som zoznam s názvom ``shopping`` ("nákup"), ktorý obsahuje tri položky. Python view, že je to zoznam, pretože je uzavretý v hranatých zátvorkách (``[`` a ``]``). Položky v zozname sú oddelené čiarkou (``,``) a v tomto prípade sú položky tri reťazce znakov: ``"Vajíčka"``, ``"Slanina"`` and ``"Rajčiny"``. Vieme, že sú to reťazce znakov, pretože sú uzavreté v úvodzovkách ``"``.

source: You can store anything in a list with Python. Here's a list of numbers::
sk: V Pythone môžeš v zozname uložiť čokoľvek. Tu je zoznam čísel::

source: Numbers don't need to be quoted since they represent a value (rather than a string of characters). It's the difference between ``2`` (the numeric value 2) and ``"2"`` (the character/digit representing the number 2). Don't worry if this doesn't make sense right now. You'll soon get used to it.
sk: Čísla nemusia byť v úvodzovkách, pretože predstavujú hodnotu (teda nie reťazec znakov). Je rozdiel medzi ``2`` (číselná hodnota 2) a ``"2"`` (znak/číslica predstavujúca číslo 2). Ak ti to zatiaľ nedáva zmysel, netráp sa tým. Čoskoro si na to zvykneš.

source: It's even possible to store different sorts of things in the same list::
sk: Dokonca je možné v jednom zozname uchovávať rôzne typy vecí::

source: Notice that last item? It was an image!
sk: Všímaš tu poslednú položku? To bol obrázok!

source: We can tell MicroPython to animate a list of images. Luckily we have a couple of lists of images already built in. They're called ``Image.ALL_CLOCKS`` and ``Image.ALL_ARROWS``::
sk: MicroPythonu môžeme povedať, aby animoval zoznam obrázkov. Našťastie už máme zopár zoznamov obrázkov už vstavaných v MicroPythone. Volajú sa ``Image.ALL_CLOCKS`` (obrázky VŠETKÝCH HODÍN) a ``Image.ALL_ARROWS`` (obrázky VŠETKÝCH ŠÍPOK)::

source: As with a single image, we use ``display.show`` to show it on the device's display. However, we tell MicroPython to use ``Image.ALL_CLOCKS`` and it understands that it needs to show each image in the list, one after the other. We also tell MicroPython to keep looping over the list of images (so the animation lasts forever) by saying ``loop=True``. Furthermore, we tell it that we want the delay between each image to be only 100 milliseconds (a tenth of a second) with the argument ``delay=100``.
sk: Tak ako pri samostatnom obrázku, používame ``display.show`` na zobrazenie obrázkov na displeji zariadenia. Ale tentokrát povieme MicroPythonu, že má použiť ``Image.ALL_CLOCKS`` a on rozumie, že má zobraziť každý obrázok zo zoznamu, jeden po druhom. Taktiež povieme MicroPythonu, že má zobrazovanie opakovať (takže animácia bude trvať donekonečna) pomocou argumentu ``loop=True``. Navyše mu povieme, že chceme, aby medzi jednotlivými obrázkamibol interval (prestávka) iba 100 milisekúnd (desatina sekundy) pomocou argumentu ``delay=100``.

source: Can you work out how to animate over the ``Image.ALL_ARROWS`` list? How do you avoid looping forever (hint: the opposite of ``True`` is ``False`` although the default value for ``loop`` is ``False``)? Can you change the speed of the animation?
sk: Prídeš na to, ako animovať zoznam šípok ``Image.ALL_ARROWS``? Ako sa vyhneš opakovaniu donekonečna (rada: opak ``True`` ("Pravda") je ``False`` ("Nepravda") ale predvolená hodnota opakovania je ``loop = False``)? Dokážeš zmeniť rýchlosť animácie?

source: Finally, here's how to create your own animation. In my example I'm going to make my boat sink into the bottom of the display::
sk: Na záver je tu ukážka, ako si urobiť vlastnú animáciu. V mojom prípade potopím svoju loď pod okraj displeja::

source: Here's how the code works:
sk: Takto funguje kód:

source: I create six ``boat`` images in exactly the same way I described above.
sk: Vytvoril som šesť obrázkov člnu (``boat``) presne podľa plánu, ktorý som popísal vyššie.

source: Then, I put them all into a list that I call ``all_boats``.
sk: Teraz ich všetky vložím do zoznamu s názvom ``all_boats`` (všetky člny)

source: Finally, I ask ``display.show`` to animate the list with a delay of 200 milliseconds.
sk: Nakoniec zavolám metódu ``display.show``, ktorá mi animuje zoznam s intervalom 200 milisekúnd.

source: Since I've not set ``loop=True`` the boat will only sink once (thus making my animation scientifically accurate). :-)
sk: Keďže som nenastavil ``loop=True`` čl sa potopí iba raz (a teda urobíme tak animáciu z vedeckého hľadiska presnú). :-)

source: What would you animate? Can you animate special effects? How would you make an image fade out and then fade in again?
sk: Čo budeš animovať ty? Dokážeš animovať špeciálne efekty? Ako by si spravil(a), aby obrázok vybledol a opäť sa objavil?
