Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/introduction.po
Languages: sk_sk

source: Introduction
sk_sk: Úvod

source: We suggest you download and use the `mu editor <http://codewith.mu/>`_ when working through these tutorials. Instructions for downloading and installing Mu are on its website. You may need to install a driver, depending on your platform (instruction are on the website).
sk_sk: Na prácu s týmtio návodmi ti odporúčame stiahnuť si a používať `mu editor <http://codewith.mu/>`_ . Inštrukcie na stiahnutie a inštaláciu Mu sú na ich web stránke. Možno budeš musieť nainštalovať driver, záleží, aký máš operačný systém (inštrukcie sú na web stránke).

source: Mu works with Windows, OSX and Linux.
sk_sk: Mu pracuje pod Windowsom, OSX aj Linuxom.

source: Once Mu is installed connect your micro:bit to your computer via a USB lead.
sk_sk: Ak už máš nainštalovaný Mu, pripoj svoj micro:bit k počítaču cez USB kábel.

source: Write your script in the editor window and click the "Flash" button to transfer it to the micro:bit. If it doesn't work, make sure your micro:bit appears as a USB storage device in your file system explorer.
sk_sk: V editore napíš svoj skript a klikni na tlačítko "Flash", ktorýmho odošleš na micro:bit. Ak to nefunguje, uisti sa, že tvoj micro:bit sa zobrazuje v tvojom systéme ako USB zariadenie.

source: Tutorials
sk_sk: Návody

source: Python is one of the `world's most popular <http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html>`_ programming languages. Every day, without realising, you probably use software written using Python. All sorts of companies and organisations use Python for a diverse range of applications. Google, NASA, Bank of America, Disney, CERN, YouTube, Mozilla, The Guardian - the list goes on and covers all sectors of the economy, science and the arts.
sk_sk: Python je jeden z `najobľúbenejších <http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html>`_ programovacích jazykov na svete. Každý deň, bez toho, aby si si to uvedomil(a), pravdepodobne používaš softvér napísaný v Pythone. Python používajú rôzne spoločnosti a organizácie na množstvo rozličných úloh a aplikácií. Google, NASA, Bank of America, Disney, CERN, YouTube, Mozilla, The Guardian - a mnoho ďalších, ktorí pokrývajú všetky segmenty ekonomiky, vedy a umenia.

source: For example, do you remember the announcement of the `discovery of gravitational waves <http://www.bbc.co.uk/news/science-environment-35552207>`_? The instruments used to make the measurements were controlled `with Python <https://www.reddit.com/r/IAmA/comments/45g8qu/we_are_the_ligo_scientific_collaboration_and_we/czxnlux>`_.
sk_sk: Napríklad, pamätáš si na oznámenie `objavu gravitačných vĺn<http://www.bbc.co.uk/news/science-environment-35552207>`_? Nástroj, ktorým sa vykonávali tieto merania bol napísaný v `Pythone <https://www.reddit.com/r/IAmA/comments/45g8qu/we_are_the_ligo_scientific_collaboration_and_we/czxnlux>`_.

source: Put simply, if you teach or learn Python, you are developing a highly valuable skill that applies to all areas of human endeavour.
sk_sk: Jednoducho povedané, ak sa učíš alebo dokonca vyučuješ Python, vytváraš veľmi cennú zručnosť, ktorá sa dá využiť vo všetkých oblastiach.

source: One such area is the BBC's amazing micro:bit device. It runs a version of Python called MicroPython that's designed to run on small computers like the BBC micro:bit. It's a full implementation of Python 3 so when you move onto other things (such as programming Python on a Raspberry Pi) you'll use exactly the same language.
sk_sk: Jednou z takých oblastí je úžasné zariadenie BBC micro:bit. Beží na ňom špeciálna verzia Pythonu, ktorá sa volá MicroPython vytvorená presne pre to, aby bežala na malých zariadeniach ako je napríklad BBC micro:bit.Je to úplná implementácia Pythonu 3, takže keď sa presunieš na programovanie s inými zariadeniami (napríklad Raspberry Pi), budeš používať rovnaký jazyk.

source: MicroPython does not include all the standard code libraries that come with "regular" Python. However, we have created a special ``microbit`` module in MicroPython that lets you control the device.
sk_sk: MicroPython neobsahuje všetky štandardné knižnice, ktoré sú v "normálnom" Pythone. Ale v Micropythone sme vytvorili špeciálny modul ``microbit``, ktorý ti umožní ovládať toto zariadenie.

source: Python and MicroPython are free software. Not only does this mean you don't pay anything to use Python, but you are also free to contribute back to the Python community. This may be in the form of code, documentation, bug reports, running a community group or writing tutorials (like this one). In fact, all the Python related resources for the BBC micro:bit have been created by an international team of volunteers working in their free time.
sk_sk: Python and MicroPython sú voľné softvéry. Neznamená to len to, že za používanie Pythonu neplatíš, ale dokonca môžeš prispievať Python komunite.Či už vo forme kódu, dokumentácie, reportovaniu chýb, prevádzkovaniukomunitnej skupiny alebo písaním návodov, ako je napríklad tento. Vlastne všetky zdroje pre micro:bit súvisiace s Pythonom boli vytvorené medzinárodným tímom dobrovoľníkov, ktorí na nich pracovali vo svojom voľnom čase.

source: These lessons introduce MicroPython and the BBC micro:bit in easy-to-follow steps. Feel free to adopt and adapt them for classroom based lessons, or perhaps just follow them on your own at home.
sk_sk: Tieto lekcie predstavujú MicroPython a BBC micro:bit pomocou jednoduchýchkrokov. Pokojne si ich prispôsobte pre svojich žiakov, alebo podľa nich postupujte doma samostatne.

source: You'll have most success if you explore, experiment and play. You can't break a BBC micro:bit by writing incorrect code. Just dive in!
sk_sk: Najviac úspechov dosiahneš pri skúmaní, experimentovaní a hraní sa. BBC micro:bit zlým kódom nepokazíš. Takže smelo do toho!

source: A word of warning: *you will fail many times*, and that is fine. **Failure is how good software developers learn**. Those of us who work as software developers have a lot of fun tracking down bugs and avoiding the repetition of mistakes.
sk_sk: Malá výstraha: *veľa krát zlyháš*, a to je úplne v poriadku. **Zlyhanie je spôsob, akým sa programátori učia**. Tí z nás, ktorí pracujú ako programátori sa často zabávajú tým, že hľadajú chyby a snažia sa im v budúcnosti vyhnúť.

source: If in doubt, remember the Zen of MicroPython::
sk_sk: V prípade pochybností, spomeň si na Zen MicroPythonu:

source: Best of luck!
sk_sk: Veľa šťastia!
