Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/io.po
Languages: sk

source: The image of the pizeo buzzer is CC BY-NC-SA 3.0 from https://www.flickr.com/photos/tronixstuff/4821350094
sk: Obrázok piezo bzučiaka je licencovaný pod licenciou CC BY-NC-SA 3.0 z https://www.flickr.com/photos/tronixstuff/4821350094

source: Input/Output
sk: Vstup/Výstup

source: There are strips of metal along the bottom edge of the BBC micro:bit that make it look as if the device has teeth. These are the input/output pins (or I/O pins for short).
sk: Na spodnom okraji micro:bitu sa nachádzajú kovové prúžky, vďaka ktorým vyzerá trochu, ako keby mal zuby. Sú to vstupno/výstupné piny (skrátene tiež I/O piny).

source: Some of the pins are bigger than others so it's possible to attach crocodile clips to them. These are the ones labelled 0, 1, 2, 3V and GND (computers always start counting from zero). If you attach an edge connector board to the device it's possible to plug in wires connected to the other (smaller) pins.
sk: Niektoré piny sú väčšie ako iné, takže je možné k nim pripojiť krokodílky. Sú označené 0, 1, 2, 3V a GND (počítače vždy počítajú od nuly). Ak ku zariadeniu pridáš konektorovú dosku, bude možné zapojiť aj káble pripojené k ďalším (menším) pinom.

source: Each pin on the BBC micro:bit is represented by an *object* called ``pinN`` where ``N`` is the pin number. So, for example, to do things with the pin labelled with a 0 (zero), use the object called ``pin0``.
sk: Každému pinu na micro:bite zodpovedá *objekt* s názvom ``pinN``, kde ``N`` je číslo pinu. Takže napríklad, ak chceme niečo robiť s pinom označeným ako 0 (nula), použijeme objekt s názvom ``pin0``.

source: Simple!
sk: Jednoduché!

source: These objects have various *methods* associated with them depending upon what the specific pin is capable of.
sk: K týmto objektom sú priradené rôzne *metódy* podľa toho, čo ktorý pin dokáže robiť.

source: Ticklish Python
sk: Šteklivý Python

source: The simplest example of input via the pins is a check to see if they are touched. So, you can tickle your device to make it laugh like this::
sk: Najjednoduchší príklad vstupu cez piny je zistiť, či sa ich niečo dotýka. Takže môžeme poštekliť naše zariadenie, aby sa smialo - takto::

source: With one hand, hold your device by the GND pin. Then, with your other hand, touch (or tickle) the 0 (zero) pin. You should see the display change from grumpy to happy!
sk: Jednou rukou drž zariadenie za pin GND. Potom sa druhou rukou dotkni (alebo poštekli) pin 0 (nula). Mal(a) by si vidieť, že displej sa zmení z mrzutého na šťastný!

source: This is a form of very basic input measurement. However, the fun really starts when you plug in circuits and other devices via the pins.
sk: Toto je úplne najzákladnéejší spôsob merania vstupov. Ale skutočná zábava začína až keď zapojíš obvody a ďalšie zariadenia cez piny.

source: Bleeps and Bloops
sk: Pípanie a bublanie

source: The simplest thing we can attach to the device is a Piezo buzzer. We're going to use it for output.
sk: Najjednoduchšia vec, ktorú vieme pripojiť k zariadeniu je Piezo bzučiak. Budeme ho používať na výstup.

source: These small devices play a high-pitched bleep when connected to a circuit. To attach one to your BBC micro:bit you should attach crocodile clips to pin 0 and GND (as shown below).
sk: Keď sú tieto malé zariadenia zapojené do obvodu, vydávajú vysoký piskľavý zvuk. Na pripojenie k micro:bitu ti postačí zapojiť krokodílky na piny 0 a GND (ako na obrázku nižšie).

source: The wire from pin 0 should be attached to the positive connector on the buzzer and the wire from GND to the negative connector.
sk: Drôt z pinu 0 musí byť pripojený na kladný konektor na bzučiaku a drôt z GND musí ísť na záporný konektor.

source: The following program will cause the buzzer to make a sound::
sk: Tento program spôsobí, že bzučiak vydá zvuk::

source: This is fun for about 5 seconds and then you'll want to make the horrible squeaking stop. Let's improve our example and make the device bleep::
sk: Toto je zábavné asi tak 5 sekúnd a potom už chceš ten príšerný piskot zastaviť. Vylepšime teda náš príklad a zariaďme, aby zariadenie pípalo::

source: Can you work out how this script works? Remember that ``1`` is "on" and ``0`` is "off" in the digital world.
sk: Rozumieš tomu, ako ten skript funguje? Nezabudni, že vo svete počítačov ``1`` znamená "zapnuté" ("on") a ``0`` je "vypnuté" ("off").

source: The device is put into an infinite loop and immediately switches pin 0 on. This causes the buzzer to emit a beep. While the buzzer is beeping, the device sleeps for twenty milliseconds and then switches pin 0 off. This gives the effect of a short bleep. Finally, the device sleeps for 480 milliseconds before looping back and starting all over again. This means you'll get two bleeps per second (one every 500 milliseconds).
sk: Zariadenie je v nekonečnom cykle a okamžite zapína pin 0. To spôsobí, že bzučiak pípne. Kým bzučiak pípa, zariadenie spí 20 milisekúnd a potom pin 0 vypne. Toto vytvára zdanie krátkeho pípnutia. Nakoniec zariadenie spí 480 milisekúnd, kým sa cyklus nespustí odznova. To znamená, že máš dve pípnutia za sekundu (každých 500 milisekúnd jedno).

source: We've made a very simple metronome!
sk: Vyrobili sme jednoduchý metronóm!
