Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/movement.po
Languages: sk

source: Movement
sk: Pohyb

source: Your BBC micro:bit comes with an accelerometer. It measures movement along three axes:
sk: Tvoj BBC micro:bit obsahuje akcelerometer, ktorý meria pohyb v troch smeroch:

source: X - tilting from left to right.
sk: X - náklon zľava do prava.

source: Y - tilting forwards and backwards.
sk: Y - náklon dopredu a dozadu.

source: Z - moving up and down.
sk: Z - pohyb hore a dole.

source: There is a method for each axis that returns a positive or negative number indicating a measurement in milli-g's. When the reading is 0 you are "level" along that particular axis.
sk: Pre každú os (smer) existuje metóda, ktorá vracia kladné alebo záporné číslo, predstavujúce počet mili-g. Ak je čítanie 0, zariadenie máš zarovnané pozdĺž konkrétnej osi.

source: For example, here's a very simple spirit-level that uses ``get_x`` to measure how level the device is along the X axis::
sk: Napríklad, takto si vyrobíš jednoduchú libelu, ktorá využíva ``get_x`` na určenie, ako je naklonené zariadenie pozdĺž osi X::

source: If you hold the device flat it should display ``-``; however, rotate it left or right and it'll show ``L`` and ``R`` respectively.
sk: Ak držíš zariadenie naplocho, alo by zobrazovať ``-``; no, ak ho potočíš doprava (right) alebo doľava (left), ukáže R alebo L.

source: We want the device to constantly react to change, so we use an infinite ``while`` loop. The first thing to happen *within the body of the loop* is a measurement along the X axis which is called ``reading``. Because the accelerometer is *so* sensitive I've made level +/-20 in range. It's why the ``if`` and ``elif`` conditionals check for ``> 20`` and ``< -20``. The ``else`` statement means that if the ``reading`` is between -20 and 20 then we consider it level. For each of these conditions we use the display to show the appropriate character.
sk: Keďže chceme, aby zariadenie stále reagovalo na naše zmeny, použijeme nekonečný ``while`` cyklus. Prvá vec, čo sa udeje vo *vnútri tela cyklu*, je meranie na osi X, ktorému tiež hovoríme ``čítanie``. Keďže akcelerometer je veľmi citlivý, upravil som program tak, aby rovina bola v rozsahu +/-20. Preto podmienky ``if`` a ``elif`` kontrolujú ``> 20`` a ``< -20``. Výraz ``else`` znamená, že ak je ``čítanie`` medzi -20 a 20, potom ho poukladáme za vodorovné. Pre každú z týchto podmienok používame displej na zobrazenie vhodného písmena/znaku.

source: There is also a ``get_y`` method for the Y axis and a ``get_z`` method for the Z axis.
sk: Okrem toho ešte existujú aj metódy ``get_y`` pre os Y a ``get_z`` pre os Z.

source: If you've ever wondered how a mobile phone knows which up to show the images on its screen, it's because it uses an accelerometer in exactly the same way as the program above. Game controllers also contain accelerometers to help you steer and move around in games.
sk: Ak si niekedy rozmýšľal(a), ako tvoj mobil vie, ako má otočiť obrázky na obrazovke, tak už vieš, že to robí akcelerometer rovnakým spôsobom, ako sme si práve ukázali. Rôzne herné konzoly tiež obsahujú akcelerometre, ktoré umožňujú ovládanie alebo pohyb v hrách.

source: Musical Mayhem
sk: Hudobné šialenstvo

source: One of the most wonderful aspects of MicroPython on the BBC micro:bit is how it lets you easily link different capabilities of the device together. For example, let's turn it into a musical instrument (of sorts).
sk: Jedna z najlepších vlastností MicroPythonu na BBC micro:bite je, ako ľahko môžeš pospájať rôzne funkcie zariadenia dokopy. Premeňme ho, napríklad, na hudobný nástroj (alebo čosi také).

source: Connect a speaker as you did in the music tutorial. Use crocodile clips to attach pin 0 and GND to the positive and negative inputs on the speaker - it doesn't matter which way round they are connected to the speaker.
sk: Pripoj reproduktor rovnako ako v hudobnom návode. Pomocou krokodíliek prepoj pin 0 a GND s kladným a záporným vstupom na reproduktore - nezáleží na tom, ktorý je napojený na ktorý.

source: What happens if we take the readings from the accelerometer and play them as pitches? Let's find out::
sk: Čo sa stane, ak prečítame hodnotu z akcelerometra a zahráme ju ako farbu tónu? Poďme to zistiť::

source: The key line is at the end and remarkably simple. We *nest* the reading from the Y axis as the frequency to feed into the ``music.pitch`` method. We only let it play for 10 milliseconds because we want the tone to change quickly as the device is tipped. Because the device is in an infinite ``while`` loop it is constantly reacting to changes in the Y axis measurement.
sk: Kľúčový riadok je na konci a je pozoruhodne jednoduchý. *Vnorili* sme čítanie z osi Y ako frekvenciu, ktorú použijeme v metóde ``music.pitch``. Zahráme ju len 10 milisekúnd, lebo chceme, aby sa tón rýchlo menil, keď sa micro:bit hýbe. Keďže zariadenie je v nekonečnom ``while`` cykle, neustále reaguje na zmeny v meraniach na osi Y.

source: That's it!
sk: To je ono!

source: Tip the device forwards and backwards. If the reading along the Y axis is positive it'll change the pitch of the tone played by the micro:bit.
sk: Pohýb zariadením dopredu a dozadu. Ak je čítanie na osi Y kladné, zmení sa farba tónu, ktorý hrá micro:bit.

source: Imagine a whole symphony orchestra of these devices. Can you play a tune? How would you improve the program to make the micro:bit sound more musical?
sk: Predstav si symfonický orchester takýchto zariadení. Dokážeš zahrať nejakú melódiu? Ako by si zlepšil(a) program, aby znel trochu 'hudobnejšie'?
