Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/network.po
Languages: sk_sk

source: The image of Queen Elizabeth II is licensed as per the details here: https://commons.wikimedia.org/wiki/File:Queen_Elizabeth_II_March_2015.jpg
sk_sk: Obrázok Kráľovnej Alžbety II je licencovaný s podmienkami uvedenými tu: https://commons.wikimedia.org/wiki/File:Queen_Elizabeth_II_March_2015.jpg

source: Network
sk_sk: Sieť

source: It is possible to connect devices together to send and receive messages to and from each other. This is called a network. A network of interconnected networks is called an internet. The Internet is an internet of all the internets.
sk_sk: Zariadenia vieme spájať a posielať a prijímať medzi nimi správy. Toto sa volá sieť. Sieť prepojených sietí sa nazýva internet. Internet s veľkým I je internetom všetkých internetov.

source: Networking is hard and this is reflected in the program described below. However, the beautiful thing about this project is it contains all the common aspects of network programming you need to know about. It's also remarkably simple and fun.
sk_sk: Sieťovanie je ťažké a to sa prejavuje aj na programe uvedenom nižšie. Ale krásne na tomto projekte je to, že obsahuje všetky bežné aspekty sieťového programovania. Je tiež až pozoruhodne jednoduchý a zábavný.

source: But first, let's set the scene...
sk_sk: Ale najskôr si pripravme scénu...

source: Connection
sk_sk: Pripojenie

source: Imagine a network as a series of layers. At the very bottom is the most fundamental aspect of communication: there needs to be some sort of way for a signal to get from one device to the other. Sometimes this is done via a radio connection, but in this example we're simply going to use two wires.
sk_sk: Predstav si sieť ako sériu vrstiev. Na úplnom spodku je najzákladnejší aspekt komunikácie: tu sa nejako musí dostať signál z jedného zariadenia na druhé. Toto sa niekedy robí pomocou rádiového spojenia, ale v tomto prípade to urobíme jednoducho pomocou káblov.

source: It is upon this foundation that we can build all the other layers in the *network stack*.
sk_sk: Na tomto základe vieme vystavať všetky ďalšie *vrstvy siete*.

source: As the diagram shows, blue and red micro:bits are connected via crocodile leads. Both use pin 1 for output and pin 2 for input. The output from one device is connected to the input on the other. It's a bit like knowing which way round to hold a telephone handset - one end has a microphone (the input) and the other a speaker (the output). The recording of your voice via your microphone is played out of the other person's speaker. If you hold the phone the wrong way up, you'll get strange results!
sk_sk: Ako ukazuje diagram, modré a červené micro:bits sú prepojené pomocou krokodíliek. Obidva používajú pin 1 na výstup a pin 2 na vstup. Výstup z jedného zariadenie je spojený so vstupom na druhom. Je to trochu ako vedieť správne otočiť telefón - jeden koniec má mikrofón (vstup) a druhý má reproduktor (výstup). Nahrávka tvojho hlasu cez mikrofón sa púšťa do reproduktoru druhého telefónu. Ak držíš telefón naopak, dostaneš čudné výsledky!

source: It's exactly the same in this instance: you must connect the wires properly!
sk_sk: V našom prípade je to úplne rovnaké: káble musíš pripojiť správne!

source: Signal
sk_sk: Signál

source: The next layer in the *network stack* is the signal. Often this will depend upon the characteristics of the connection. In our example it's simply digital on and off signals sent down the wires via the IO pins.
sk_sk: Ďalšou vrstvou vo *vrstvách siete* je signál. Ten bude často závisieť od charakteristík pripojenia. V našom príklade sú to jednoduché digitálne signály vypnuté a zapnuté, ktoré sa posielajú káblami cez IO piny.

source: If you remember, it's possible to use the IO pins like this::
sk_sk: Ak si spomínaš, IO piny vieme použiť takto::

source: The next step involves describing how to use and handle a signal. For that we need a...
sk_sk: Ďalší krok obsahuje popis toho, ako použiť a spracovať signál. Na to budeme potrebovať...

source: Protocol
sk_sk: Protokol

source: If you ever meet the Queen there are expectations about how you ought to behave. For example, when she arrives you may bow or curtsey, if she offers her hand politely shake it, refer to her as "your majesty" and thereafter as "ma'am" and so on. This set of rules is called the royal protocol. A protocol explains how to behave given a specific situation (such as meeting the Queen). A protocol is pre-defined to ensure everyone understands what's going on before a given situation arises.
sk_sk: Ak sa niekedy pôjdeš stretnúť s kráľovnou, budú od teba očakávať nejaké správanie. Napríklad, keď príde, mal(a) by si sa ukloniť, ak ti podá ruku, máš ňou slušne potriasť, pri prvom oslovení jej musíš povedať "vaša výsosť" a potom v ďalšom rozhovore "madam" a tak ďalej. Tento súbor pravidiel sa nazýva kráľovský protokol. Protokol vysvetľuje, ako sa správať v určitých situáciách (napríklad pri stretnutí s kráľovnou). Protokol je definovaný vopred, takže každý už pred stretnutím vie, čo sa bude diať ešte predtým, ako situácia vôbec nastane.

source: It is for this reason that we define and use protocols for communicating messages via a computer network. Computers need to agree before hand how to send and receive messages. Perhaps the best known protocol is the hypertext transfer protocol (HTTP) used by the world wide web.
sk_sk: Z toho istého dôvodu definujeme a používame protokoly na posielanie správ prostredníctvom počítačovej siete. Počítače sa najskôr musia dohodnúť, ako budú posielať a prijímať správy. Asi najznámejším protokolom je hyeprtextový prenosový protokol (HTTP), ktorý používa aj celosvetová sieť Internet.

source: Another famous protocol for sending messages (that pre-dates computers) is Morse code. It defines how to send character-based messages via on/off signals of long or short durations. Often such signals are played as bleeps. Long durations are called dashes (``-``) whereas short durations are dots (``.``). By combining dashes and dots Morse defines a way to send characters. For example, here's how the standard Morse alphabet is defined::
sk_sk: Ďalší slávny protoko na posielanie správ (ešte z obdobia pred počítačmi) je Morseov kód. Ten definuje ako posielať správy zložené zo znakov pomocou dlhších a kratších signálov. Tieto signály sa často zahrajú ako pípnutia. Tie dlhšie sa volajú pomlčky (``-``) a kratšie nazývame bodky (``.``). Kombináciou pomlčiek a bodiek Morse definoval spôsob ako posielať znaky. Tu je napríklad definícia štandardnej Morseovej abecedy::

source: Given the chart above, to send the character "H" the signal is switched on four times for a short duration, indicating four dots (``....``). For the letter "L" the signal is also switched on four times, but the second signal has a longer duration (``.-..``).
sk_sk: Podľa vyššie uvedenej tabuľky, na poslanie znaku "H" musíme signál štyrikrát zapnúť na krátky čas, čo predstavuje štyri bodky (``....``). Na písmeno "L" potrebujeme tiež štyri signály, ale druhý v poradí trvá dlhšie (``.-..``).

source: Obviously, the timing of the signal is important: we need to tell a dot from a dash. That's another point of a protocol, to agree such things so everyone's implementation of the protocol will work with everyone elses. In this instance we'll just say that:
sk_sk: Samozrejme, aj načasovanie signálu je dôležité: musíme vedieť rodlíšiť bodku od pomlčky. To je ďalším bodom protokolu, dohodnúť také parametre, aby každý vedel ako správne implementovať protokol, aby fungoval s inými.V tomto prípade povieme:

source: A signal with a duration less than 250 milliseconds is a dot.
sk_sk: Signál kratší ako 250 milisekúnd je bodka.

source: A signal with a duration from 250 milliseconds to less than 500 milliseconds is a dash.
sk_sk: Signál dlhší ako 250 milisekúnd a kratší ako 500 milisekúnd je pomlčka.

source: Any other duration of signal is ignored.
sk_sk: Všetky ostatné dĺžky ignorujeme.

source: A pause / gap in the signal of greater than 500 milliseconds indicates the end of a character.
sk_sk: Prestávka / medzera medzi signálmi dlhšia ako 500 milisekúnd znamená koniec znaku.

source: Message
sk_sk: Správa

source: We're finally at a stage where we can build a message - a message that actually means something to us humans. This is the top-most layer of our *network stack*.
sk_sk: Konečne sme sa dostali niekam, kde môžeme vytvoriť správu - správu, ktorá už bude niečo hovoriť aj nám, ľuďom. Toto je najvyššia vrstva z našich "vrstiev siete".

source: Using the protocol defined above I can send the following sequence of signals down the physical wire to the other micro:bit::
sk_sk: S použitím vyššie definovaného protokolu môžem cez kábel poslať túto sekvenciu signálov do druhého micro:bitu::

source: Can you work out what it says?
sk_sk: Vieš zistiť, čo je v nej zakódované?

source: Application
sk_sk: Aplikácia

source: It's all very well having a network stack, but you also need a way to interact with it - some form of application to send and receive messages. While HTTP is interesting *most* people don't know about it and let their web-browser handle it - the underlying *network stack* of the world wide web is hidden (as it should be).
sk_sk: Je super mať vrstvy siete, ale potrebuješ aj vedieť s nimi narábať - nejakú aplikáciu na posielanie a prijímanie správ. Hoci HTTP protokol je zaujímavý, *väčšina* ľudí o ňom nevie a nestará sa, čo s ním robí ich prehliadač - *vrstvy siete* svetového webu (www) sú pred nimi schované (a tak by to aj malo byť).

source: So, what sort of application should we write for the BBC micro:bit? How should it work, from the user's point of view?
sk_sk: Takže akú aplikáciu napíšeme pre micro:bit? Ako by mala fungovať z hľadiska používateľa?

source: Obviously, to send a message you should be able to input dots and dashes (we can use button A for that). If we want to see the message we sent or just received we should be able to trigger it to scroll across the display (we can use button B for that). Finally, this being Morse code, if a speaker is attached, we should be able to play the beeps as a form of aural feedback while the user is entering their message.
sk_sk: Jasné, na posielanie správ by sme mali vedieť zadávať bodky a pomlčky (na to môžeme použiť tlačítko A). Ak chceme vidieť správu, ktorú sme poslali alebo práve prijali, mali by sme ju vedieť zobraziť, aby sa nám posúvala po displeji (na toto môžeme použiť tlačítko Bwe ). Nakoniec, keďže je to Morseov kód, ak je pripojený reproduktor, mali by sme vedieť zahrať užívateľovi pípnutia ako zvukovú odozvu počas tvorenia správy.

source: The End Result
sk_sk: Výsledok

source: Here's the program, in all its glory and annotated with plenty of comments so you can see what's going on::
sk_sk: Tu je program, v cele svojej kráse s množstvom komentárov, takže si môžeš pozrieť, ako funguje::

source: How would you improve it? Can you change the definition of a dot and a dash so speedy Morse code users can use it? What happens if both devices are sending at the same time? What might you do to handle this situation?
sk_sk: Ako by si ho zlepšil(a)? Vedel(a) by si zmeniť definíciu bodky a pomlčky, aby rýchlejší užívatelia mohli zadávať znaky rýchlejšie? Čo sa stane, ak obidve zariadenia posielaju správu súčasne? Čo by si mohol/mohla urobiť, aby si predišiel/predišla takejto situácii?
