Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/random.po
Languages: sk_sk

source: Random
sk_sk: Náhoda

source: Sometimes you want to leave things to chance, or mix it up a little: you want the device to act randomly.
sk_sk: Niekedy chceš veciam dopriať voľnejší priebeh alebo niečo trochu pomiešať: chceš, aby sa zariadenie správalo náhodne.

source: MicroPython comes with a ``random`` module to make it easy to introduce chance and a little chaos into your code. For example, here's how to scroll a random name across the display::
sk_sk: MicroPython obsahuje modul ``random`` ("náhoda"), vďaka ktorému vniesť trochu chaosu do tvojho kódu, je veľmi jednoduché. Napríklad takto urobíš, aby sa na displeji posúvalo náhodne vybrané meno::

source: The list (``names``) contains seven names defined as strings of characters. The final line is *nested* (the "onion" effect introduced earlier): the ``random.choice`` method takes the ``names`` list as an argument and returns an item chosen at random. This item (the randomly chosen name) is the argument for ``display.scroll``.
sk_sk: Zoznam (``names`` - "mená") obsahuje sedem mien, ktoré sú definované ako reťazce znakov. Posledný riadok je *vnorený* ("cibuľový" efekt, o ktorom sme hovorili v predchádzajúcich kapitolách): metóda ``random.choice`` ("náhoda.výber") prijme zoznam ``names`` ako argument ako vráti z neho náhodne položku. Táto položka (náhodne vybrané meno) je potom argumentom pre metódu ``display.scroll`` ("displej.posúvaj").

source: Can you modify the list to include your own set of names?
sk_sk: Dokážeš upraviť zoznam tak, aby obsahoval tvoj vlastný zoznam mien?

source: Random Numbers
sk_sk: Náhodné čísla

source: Random numbers are very useful. They're common in games. Why else do we have dice?
sk_sk: Náhodné čísla sú veľmi užitočné. V hrách sú veľmi bežné. Prečo by sme inak mali kocky?

source: MicroPython comes with several useful random number methods. Here's how to make a simple dice::
sk_sk: MicroPython obsahuje niekoľko užitočných metód na náhodné čísla. Takto jednoducho môžeme hádzať kockou::

source: Every time the device is reset it displays a number between 1 and 6. You're starting to get familiar with *nesting*, so it's important to note that ``random.randint`` returns a whole number between the two arguments, inclusive (a whole number is also called an integer - hence the name of the method). Notice that because ``display.show`` expects a character then we use the ``str`` function to turn the numeric value into a character (we turn, for example, ``6`` into ``"6"``).
sk_sk: Zakaždým, keď zariadenie resetuješ, zobrazí číslo medzi 1 a 6. Myslím, že už rozumieš *vnoreniu*, takže je dobré si všimnúť, že ``random.randint`` vracia celé číslo medzi dvoma argumentami, vrátane (celé číslo sa v Pythone volá integer, preto má metóda také meno). Pretože ``display.show`` očakáva ako argument znak, musíme použiť funkciu ``str``, ktorou premeníme číslo na znak (napríklad zmeníme ``6`` na ``"6"``).

source: If you know you'll always want a number between ``0`` and ``N`` then use the ``random.randrange`` method. If you give it a single argument it'll return random integers up to, but not including, the value of the argument ``N`` (this is different to the behaviour of ``random.randint``).
sk_sk: Ak vieš, že budeš potrebovať vždy číslo medzi ``0`` a ``N``, môžeš použiť metódu ``random.randrange``. Ak jej zadáš iba jeden argument, vráti náhodné číslo do hodnoty ``N`` (ale nie vrátane tohto čísla). Tým sa líši od správania sa metódy ``random.randint``).

source: Sometimes you need numbers with a decimal point in them. These are called *floating point* numbers and it's possible to generate such a number with the ``random.random`` method. This only returns values between ``0.0`` and ``1.0`` inclusive. If you need larger random floating point numbers add the results of ``random.randrange`` and ``random.random`` like this::
sk_sk: Niekedy potrebuješ čísla aj s desatinnou čiarkou. Voláme ich reálne čísla (angl. *floating point* numbers) a môžeme ich generovať pomocou metódy ``random.random``. Táto vracia hodnotu medzi ``0.0`` a ``1.0`` vrátane krajných hodnôt. Ak potrebuješ väčšie náhodné reálne číslo, pridaj takto výsledky metód ``random.randrange`` a ``random.random``::

source: Seeds of Chaos
sk_sk: Počiatok chaosu

source: The random number generators used by computers are not truly random. They just give random like results given a starting *seed* value. The seed is often generated from random-ish values such as the current time and/or readings from sensors such as the thermometers built into chips.
sk_sk: Generátory náhodných čísel, ktoré sa využívajú v počítačoch nie sú v skutočnosti úplne náhodné. Poskytujú akoby náhodné číslo, ktoré sa vypočíta z počiatočnej hodnoty. Počiatočná hodnota (*seed*) je často generovaná z kvázi-náhodných hodnôt ako napríklad aktuálny čas a/alebo hodnoty odčítané z rôznych senzorov, ako je napríklad v čipe vstavaný teplomer.

source: Sometimes you want to have repeatable random-ish behaviour: a source of randomness that is reproducible. It's like saying that you need the same five random values each time you throw a dice.
sk_sk: Niekedy potrebuješ opakovateľné kvázi-náhodné správanie: zdroja náhody, ktorý je reprodukovateľný. Napríklad, ak potrebuješ, aby pri každom hode kockami padlo 5 rovnakých náhodných čísel..

source: This is easy to achieve by setting the *seed* value. Given a known seed the random number generator will create the same set of random numbers. The seed is set with ``random.seed`` and any whole number (integer). This version of the dice program always produces the same results::
sk_sk: Toto zabezpečíš jednoducho pomocou nastavenej počiatočnej hodnoty. Ak zadáme známu počiatočnú hodnotu - seed, generátor náhodných čísel vytvorí rovnaký set náhodných čísel. Počiatočná hodnota sa nastavuje pomocou ``random.seed`` a akéhokovek celého čísla. Takáto verzia programu na hádzanie kockou bude dávať vždy rovnaký výsledok::

source: Can you work out why this program needs us to press button A instead of reset the device as in the first dice example..?
sk_sk: Vieš prečo tento program potrebuje, aby sme stlačili tlačítko A namiesto resetu zariadenia, ako to bolo v prvom príklade s kockami..?
