Repository: microbitsk/micropython
Catalog: docs/locale/*/LC_MESSAGES/tutorials/speech.po
Languages: sk_sk

source: The image of the DALEK is licensed as per the details here: https://commons.wikimedia.org/wiki/File:Dalek_(Dr_Who).jpg The image of DAVROS is licensed as per the details here: https://en.wikipedia.org/wiki/File:Davros_and_Daleks.jpg
sk_sk: Obrázok DALEKa je licencovaný ako je uvedené tu: https://commons.wikimedia.org/wiki/File:Dalek_(Dr_Who).jpg Obrázok DAVROSa je licencovaný ako je uvedené tu: https://en.wikipedia.org/wiki/File:Davros_and_Daleks.jpg

source: Speech
sk_sk: Reč

source: WARNING! THIS IS ALPHA CODE.
sk_sk: VAROVANIE! TENTO KÓD SA MÔŽE ZMENIŤ.

source: We reserve the right to change this API as development continues.
sk_sk: Vyhradzujeme si právo zmeniť toto API počas vývoja.

source: The quality of the speech is not great, merely "good enough". Given the constraints of the device you may encounter memory errors and / or unexpected extra sounds during playback. It's early days and we're improving the code for the speech synthesiser all the time. Bug reports and pull requests are most welcome.
sk_sk: Kvalita reči nie je veľmi vysoká, skôr "taká akurát". Vzhľadom na limity zariadenia možno narazíš na chyby pamäte a/alebo neočakávané zvuky počas prehrávania. Vývoj je ešte na začiatku a stále zlepšujeme kód rečového syntetizátora. Oznamovanie chýb a opravy formou pull requestov sú vítané.

source: Computers and robots that talk feel more "human".
sk_sk: Počítače a roboti, ktorí hovoria, vyzerajú "ľudskejšie".

source: So often we learn about what a computer is up to through a graphical user interface (GUI). In the case of a BBC micro:bit the GUI is a 5x5 LED matrix, which leaves a lot to be desired.
sk_sk: Často si hovoríme, čo chce počítač robiť prostredníctvom grafického rozhrania (GUI). V prípade BBC micro:bitu je týmto rozhraním LED matica s rozmerom 5x5, čo nedáva toľko možností, koľko by sme chceli.

source: Getting the micro:bit talk to you is one way to express information in a fun, efficient and useful way. To this end, we have integrated a simple speech synthesiser based upon a reverse-engineered version of a synthesiser from the early 1980s. It sounds very cute, in an "all humans must die" sort of a way.
sk_sk: Donútiť micro:bit rozprávať je jedným zo spôsobov, ako vyjadriť informáciu vtipne, efektívne a užitočne. Integrovali sme jednoduchý rečový syntetizátor založený na revernom inžinierstve syntetizéra z 80-tych rokov minulého storočia. Znie to veľmi milo, takým tým "všetci ľudia musia umrieť" spôsobom.

source: With this in mind, we're going to use the speech synthesiser to create...
sk_sk: S týmto na pamäti, použijeme rečový syntetizátor na vytvorenie...

source: DALEK Poetry
sk_sk: DALEKova poézia

source: It's a little known fact that DALEKs enjoy poetry ~ especially limericks. They go wild for anapestic meter with a strict AABBA form. Who'd have thought?
sk_sk: Nie je to veľmi známy fakt, ale DALEKovia majú radi poéziu ~ najmä rýmovačky limerick. Idú sa zblázniť za anapestickou metrikou striktnej AABBA formy. Kto by si to o nich bol pomyslel?

source: (Actually, as we'll learn below, it's The Doctor's fault DALEKs like limericks, much to the annoyance of Davros.)
sk_sk: (No, ako sa dozvieme neskôr, je to Doktorova chyba, že DALEKovia majú radi rýmovačky, čo dosť štve Davrosa.)

source: In any case, we're going to create a DALEK poetry recital on demand.
sk_sk: Každopádne, ideme vytvoriť recitál DALEKovej poézie na požiadanie.

source: Say Something
sk_sk: Povedz niečo

source: Before the device can talk you need to plug in a speaker like this:
sk_sk: Predtým, ako má zariadenie hovoriť, treba naň zapojiť reproduktory::

source: The simplest way to get the device to speak is to import the ``speech`` module and use the ``say`` function like this::
sk_sk: Najjednoduchšie, ako donútiť zariadenie rozprávať je importovať modul ``speech`` (reč) a použiť funkciu ``say`` (povedz)::

source: While this is cute it's certainly not DALEK enough for our taste, so we need to change some of the parameters that the speech synthesiser uses to produce the voice. Our speech synthesiser is quite powerful in this respect because we can change four parameters:
sk_sk: Hoci toto je vážne milé, rozhodne to ešte nie je pre nás dostatočne DALEKovské, takže musíme zmeniť niektoré parametre, ktoré syntetizátor používa na vytváranie hlasu. Náš rečový syntetizátor je dosť pokročilý, čo sa tohto týka, pretože vieme meniť štyri parametre:

source: ``pitch`` - how high or low the voice sounds (0 = high, 255 = Barry White)
sk_sk: ``pitch`` - ako vysoko má hlas znieť (0 = vysoko, 255 = Barry White)

source: ``speed`` - how quickly the device talks (0 = impossible, 255 = bedtime story)
sk_sk: ``speed`` - ako rýchlo má zariadenie hovoriť (0 = nemožné, 255 = uspávanka)

source: ``mouth`` - how tight-lipped or overtly enunciating the voice sounds (0 = ventriloquist's dummy, 255 = Foghorn Leghorn)
sk_sk: ``mouth`` - ako veľmi majú byť zovreté pery pri vyslovovaní (0 = bruchovravecká bábka, 255 = Foghorn Leghorn)

source: Collectively, these parameters control the quality of sound - a.k.a. the timbre. To be honest, the best way to get the tone of voice you want is to experiment, use your judgement and adjust.
sk_sk: Spoločne, tieto parametre ovládajú kvalitu zvuku - teda zafarbenie. Úprimne, najlepší tón hlasu dosiahneš tak, že budeš experimentovať a používať vlastný úsudok a nastavenia.

source: To adjust the settings you pass them in as arguments to the ``say`` function. More details can be found in the ``speech`` module's API documentation.
sk_sk: Aby si mohol/mohla upraviť nastavenia, musíš ich poslať ako argumenty funkcie ``say``. Viac podrobností nájdeš v dokumentácii modulu``speech``.

source: After some experimentation we've worked out this sounds quite DALEK-esque::
sk_sk: Po troche experimentov sme uznali tento zvuk ako vcelku DALEKovský.

source: Poetry on Demand
sk_sk: Poézia na požiadanie

source: Being Cyborgs DALEKs use their robot capabilities to compose poetry and it turns out that the algorithm they use is written in Python like this::
sk_sk: Keďže sú kyborgovia, DALEKovia používajú svoje robotie schopnosti na tvorbu poézie a vyzerá to, že algoritmus, ktorý používajú, je napísaný v Pythone a vyzerá takto::

source: As the comments demonstrate, it's a very simple in design:
sk_sk: Ako naznačujú komentáre, je veľmi jednoduchý:

source: Named fragments (``location``, ``prop``, ``attitude`` etc) are randomly generated from pre-defined lists of possible values. Note the use of ``random.choice`` to select a single item from a list.
sk_sk: Pomenované fragmenty (``location``, ``prop``, ``attitude`` atď.) sú náhodne generované preddefinované zoznamy možných hodnôt. Všimni si, že používame metódu ``random.choice`` na výber položky zo zoznamu.

source: A template of a poem is defined as a list of stanzas with "holes" in them (denoted by ``{}``) into which the named fragments will be put using the ``format`` method.
sk_sk: Šablóna básne je definovaná ako zoznam strof s "dierami" (označenými pomocou ``{}``), do ktorých budeme vkladať pomenované fragmenty pomocou metódy ``format``.

source: Finally, Python loops over each item in the list of filled-in poetry stanzas and uses ``speech.say`` with the settings for the DALEK voice to recite the poem. A pause of 500 milliseconds is inserted between each line because even DALEKs need to take a breath.
sk_sk: Nakoniec, Python prechdádza všetky položky zoznamu predpripravených strof a používa ``speech.say`` s nastaveniami pre DALEKov hlas na recitovanie básne. Medzi riadky je vložená 500-milisekundová prestávka, pretože aj DALEKovia sa niekedy potrebujú nadýchnuť.

source: Interestingly the original poetry related routines were written by Davros in `FORTRAN <https://en.wikipedia.org/wiki/Fortran>`_ (an appropriate language for DALEKS since you type it ALL IN CAPITAL LETTERS). However, The Doctor went back in time to precisely the point between Davros's `unit tests <https://en.wikipedia.org/wiki/Unit_testing>`_ passing and the `deployment pipeline <https://en.wikipedia.org/wiki/Continuous_delivery>`_ kicking in. At this instant he was able to insert a MicroPython interpreter into the DALEK operating system and the code you see above into the DALEK memory banks as a sort of long hidden Time-Lord `Easter Egg <https://en.wikipedia.org/wiki/Easter_egg_(media)>`_ or `Rickroll <https://www.youtube.com/watch?v=dQw4w9WgXcQ>`_.
sk_sk: Zaujímavé je, že pôvodné funkcie na poéziu boli napísané Davrosom vo `FORTRANe <https://en.wikipedia.org/wiki/Fortran>`_ (vhodný jazyk pre DALEKSov, keďže píšeš VŠETKO VEĽKÝMI PÍSMENAMI). Avšak, Doktor sa vrátil v čase presne do bodu medzi tým, kedy Davrosove `unit testy <https://en.wikipedia.org/wiki/Unit_testing>`_ prechádzali a chystal `nasadenie <https://en.wikipedia.org/wiki/Continuous_delivery>`_ . V tomto okamihu mohol vložiť interpreter MicroPythonu do DALEKovho operačného systému a vyššie uvedený kód do Dalekovej pamäťovej banky ako `Prekvapenie <https://en.wikipedia.org/wiki/Easter_egg_(media)>`_ alebo `Chyták <https://www.youtube.com/watch?v=dQw4w9WgXcQ>`_ Pána času.

source: Phonemes
sk_sk: Fonémy

source: You'll notice that sometimes, the ``say`` function doesn't accurately translate from English words into the correct sound. To have fine grained control of the output, use phonemes: the building-block sounds of language.
sk_sk: Môžeš si všimnúť, že funkcia ``say`` nie vždy preloží presne anglické slová do správneho zvuku. Aby si mal(a) extra citlivú kontrolu nad výstupom, používaj fonémy: základné stavebné bloky zvukov jazyka.

source: The advantage of using phonemes is that you don't have to know how to spell! Rather, you only have to know how to say the word in order to spell it phonetically.
sk_sk: Výhodou používania foném je, že nemusíš presne vedieť, ako sa to píše. Naopak, musíš vedieť, ako to slovo povedať a vyhláskovať ho foneticky.

source: A full list of the phonemes the speech synthesiser understands can be found in the API documentation for speech. Alternatively, save yourself a lot of time by passing in English words to the ``translate`` function. It'll return a first approximation of the phonemes it would use to generate the audio. This result can be hand-edited to improve the accuracy, inflection and emphasis (so it sounds more natural).
sk_sk: Kompletný zoznam foném, ktoré rečový syntetizátor pozná sa nachádza v API dokumentácii k rečovému modulu. Alebo ušetri si kopec času posielaním anglických slov funkcii ``translate``. Vráti ti len prvé priblíženie foném, ktoré použije na generovanie zvukového výstupu. Tento výsledok môžeš ďalej ručne upraviť a zlepšiť jeho presnosť, ohýbanie a dôraz (aby znel prirodzenejšie).

source: The ``pronounce`` function is used for phoneme output like this::
sk_sk: Funkcia ``pronounce`` (vyslov) sa používa na výstup foném takto::

source: How could you improve on The Doctor's code to make it use phonemes?
sk_sk: Ako by si mohol/mohla zlepšiť Doktorov kód na výrobu týchto foném?

source: Sing A Song of Micro:bit
sk_sk: Zaspievaj pieseň Micro:bitu

source: By changing the ``pitch`` setting and calling the ``sing`` function it's possible to make the device sing (although it's not going to win Eurovision any time soon).
sk_sk: Zmenou nastavenia výšky - ``pitch`` a zavolaním funkcie ``sing`` (spievaj) je možné donútiť zariadenie spievať (i keď zrejme tak skoro nevyhrá Eurovíziu).

source: The mapping from pitch numbers to musical notes is shown below:
sk_sk: Mapovanie výšok (pitch) do hudobných nôt je nižšie:

source: The ``sing`` function must take phonemes and pitch as input like this::
sk_sk: Funkcia ``sing`` (spievaj) vezme fonémy a výšku ako vstupy:

source: Notice how the pitch to be sung is prepended to the phoneme with a hash (``#``). The pitch will remain the same for subsequent phonemes until a new pitch is annotated.
sk_sk: Všimni si, ako výška, ktorá sa má zaspievať je na začiatku pred fonémou s mriežkou (``#``). Výška zostane rovnaká aj pre nasledujúce fonémy, kým nebude zadaná nová výška.

source: The following example demonstrates how all three generative functions (``say``, ``pronounce`` and ``sing``) can be used to produce speech like output:
sk_sk: Nasledujúci príklad ukazuje ako môžu byť použité všetky tri generujúce funkcie (``say``, ``pronounce`` a ``sing``) na vytvorenie výstupu, ktorý znie ako reč:
